export const UserQuestion = ({ user, message, date }) => {
  return (
    <div className='p-6 text-xl rounded-xl border-2 my-4'>
      <p className='text-green-500'>max162454:</p>
      <p className='text-neutral-400 mb-4'>пн, 12.05.2008 - 03:05</p>
      <div>
        В растениеводстве при выращивании картофеля пожалуй был есть и будет
        самым сильным вредителем колорадский жук, как бы не бились фермеры в
        борьбе с ним все никак победить немогут, вот и у нас на юге не успела
        картошка толком взойти, как уже сидит он голубчик на ней, важный такой,
        полоатый, личинки токладывает, так что у нас на юге битва с этим
        картофельным монстром уже началась.
      </div>
    </div>
  );
};
